2InletsABL_case470_refined/system/blockMeshDict_2D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
#include "../data"
vertices
(
	(0 0.1 0)
	(0 0 0)
	(0 0 $hMax)
	(0 0.1 $hMax)
        (80 0.1 0)
        (80 0 0)
        (80 0 $hMax)
        (80 0.1 $hMax)
        (0 0.1 -2)
        (0 0 -2)
        (80 0.1 -2)
        (80 0 -2)
);

blocks
(
    hex (1 5 4 0 2 6 7 3) (640 1 $hMaxSubd) simpleGrading (1 1 1)
    hex (9 11 10 8 1 5 4 0) (640 1 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    inlet_air
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    inlet_water
    {
        type patch;
        faces
        (
            (8 9 1 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 11 5 4)
            (4 5 6 7)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (8 10 11 9)
        );
    }
    side
    {
        type symmetry;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
            (8 0 4 10)
            (1 9 11 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
