2InletsABL_case470_refined/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    inlet_air
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet_water
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
       type            inletOutlet;
       inletValue      $internalField;
       value           $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    side
    {
        type            symmetry;
    }

    bottom
    {
        type symmetryPlane;
    }
}



// ************************************************************************* //
