2InletsABL_case470_refined/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    tutto;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-999 -999 -0.5) (999 999 0.5);
        }
    }
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-9 -4 -3) (5 4 2.5);
        }
    }
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-8 -3 -2.5) (3.5 3 2);
        }
    }
    {
        name    c3;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-7 -2.5 -1) (2.5 2.5 1.5);
        }
    }
    {
        name    c4;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-6.5 -2 -0.6) (1.5 2 1);
        }
    }
    {
        name    c5;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-6 -1.5 -0.4) (1 1.5 0.8);
        }
    }
    {
        name    c6;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-5.5 -1.1 -0.3) (0.7 1.1 0.5);
        }
    }
);

// ************************************************************************* //
